       01  WS-CTACTES-REC.
           05  WS-CTA-ID              PIC S9(9) COMP.
           05  WS-CTA-ID-CLIENTE      PIC S9(9) COMP.
           05  WS-CTA-COD-ULT-MOV     PIC S9(9) COMP.
           05  WS-CTA-FECHA-ULT-MOV   PIC X(10).
           05  WS-CTA-IMPORTE-MOV     PIC S9(10)V99 COMP-3.
           05  WS-CTA-SALDO-ACTUAL    PIC S9(10)V99 COMP-3.
