       01  WS-TARJETAS-REC.
           05  WS-TAR-ID-CLIENTE      PIC S9(9) COMP.
           05  WS-TAR-NRO-TARJETA     PIC X(16).
           05  WS-TAR-FECHA-VENC      PIC X(10).
           05  WS-TAR-LIMITE          PIC S9(10)V99 COMP-3.
           05  WS-TAR-ACUM-MES        PIC S9(10)V99 COMP-3.
           05  WS-TAR-LIQ-MES         PIC S9(10)V99 COMP-3.
